# Sorting data

In [1]:
import pandas as pd

In [3]:
data = {
    "Name": ["Ram", "Shayam", "Ghansyam", "Kam", "Aaram", "Sharam", "Gharam"],
    "Age": [12, 13, 14, 20, 16, 11, 15],
    "City": ["Delhi", "Mumbai", "Kolkata", "Noida", "Bangalore", "Hyderabad", "Pune"],
    "Salary": [1000, 2000, 3000, 4000, 5000, 6000, 7000],
    "Performance Score": [56, 85, 95, 62, 75, 88, 90],
}

df = pd.DataFrame(data)
print(df)

       Name  Age       City  Salary  Performance Score
0       Ram   12      Delhi    1000                 56
1    Shayam   13     Mumbai    2000                 85
2  Ghansyam   14    Kolkata    3000                 95
3       Kam   20      Noida    4000                 62
4     Aaram   16  Bangalore    5000                 75
5    Sharam   11  Hyderabad    6000                 88
6    Gharam   15       Pune    7000                 90

-   df.sort_values(by='column_name', ascending=True/False, inplace=True)

In [5]:
df.sort_values(by='Age', ascending=False, inplace=True)
df

       Name  Age       City  Salary  Performance Score
3       Kam   20      Noida    4000                 62
4     Aaram   16  Bangalore    5000                 75
6    Gharam   15       Pune    7000                 90
2  Ghansyam   14    Kolkata    3000                 95
1    Shayam   13     Mumbai    2000                 85
0       Ram   12      Delhi    1000                 56
5    Sharam   11  Hyderabad    6000                 88

In [6]:
df.sort_values(by='Age', ascending=True, inplace=True)
df

       Name  Age       City  Salary  Performance Score
5    Sharam   11  Hyderabad    6000                 88
0       Ram   12      Delhi    1000                 56
1    Shayam   13     Mumbai    2000                 85
2  Ghansyam   14    Kolkata    3000                 95
6    Gharam   15       Pune    7000                 90
4     Aaram   16  Bangalore    5000                 75
3       Kam   20      Noida    4000                 62